Revit 2026 API
AlphanumericRevisionSettings Class
 Contains settings that apply to Revisions with the Alphanumeric RevisionNumberType.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AlphanumericRevisionSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class AlphanumericRevisionSettings : IDisposable
Public Class AlphanumericRevisionSettings
	Implements IDisposable
public ref class AlphanumericRevisionSettings : IDisposable
type AlphanumericRevisionSettings =
    class
        interface IDisposable
    end
The AlphanumericRevisionSettings type exposes the following members.
Constructors
Name | Description
AlphanumericRevisionSettings() |  Constructs an AlphanumericRevisionSettings with a simple, default sequence.
AlphanumericRevisionSettings(AlphanumericRevisionSettings) |  Constructs a new copy of the input AlphanumericRevisionSettings object.
AlphanumericRevisionSettings(IList<String>, String, String) | Initializes a new instance of the AlphanumericRevisionSettings class
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Prefix |  The prefix string that will be prepended to the number of each revision with Alphanumeric RevisionNumberingType.
Suffix |  The suffix string that will be appended to the number of each revision with Alphanumeric RevisionNumberingType.
Top
Methods
Name | Description
Dispose | Releases all resources used by the AlphanumericRevisionSettings
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetSequence |  Gets a list containing the strings to be used as the numbering sequence for revisions with the Alphanumeric RevisionNumberType.
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsEqual |  Determines whether a specified AlphanumericRevisionSettings is the same as 'this'.
IsValid |  Determines whether the AlphanumericRevisionSettings object is in a valid state.
SetSequence
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace